Tekla Open API Reference for Tekla Structures 2025
TextFile.TextFileAttributes.LineType Property
Note: This API is now obsolete.
[Missing <summary> documentation for "P:Tekla.Structures.Drawing.TextFile.TextFileAttributes.LineType"]
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute]
public LineTypeAttributes LineType { get; set; }
<ObsoleteAttribute>
Public Property LineType As LineTypeAttributes
	Get
	Set
Property Value
Type: LineTypeAttributes
See Also
Reference
TextFile.TextFileAttributes Class
Tekla.Structures.Drawing Namespace